Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>ipfs</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # github_repository.this["rainbow"] will be updated in-place
  ~ resource "github_repository" "this" {
      ~ archived                    = true -> false
      ~ default_branch              = "master" -> "main"
        id                          = "rainbow"
        name                        = "rainbow"
      ~ topics                      = [
          + "http",
          + "ipfs",
          + "ipfs-gateway",
        ]
        # (30 unchanged attributes hidden)

      ~ security_and_analysis {

          ~ secret_scanning {
              ~ status = "disabled" -> "enabled"
            }

          ~ secret_scanning_push_protection {
              ~ status = "disabled" -> "enabled"
            }
        }
    }

  # github_repository_file.this["rainbow/.github/workflows/stale.yml"] must be replaced
-/+ resource "github_repository_file" "this" {
      ~ branch              = "master" -> "main" # forces replacement
      ~ commit_sha          = "9c4cd6c4403a2a2618a804cdb191795a0c14238e" -> (known after apply)
      ~ id                  = "rainbow/.github/workflows/stale.yml" -> (known after apply)
      ~ ref                 = "master" -> (known after apply)
      ~ sha                 = "6f6d895d19361a0219079a97d8eb216f5d9e66a1" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # github_team_repository.this["admin:rainbow"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "rainbow"
      + team_id    = "1516991"
    }

  # github_team_repository.this["ipdx:rainbow"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "rainbow"
      + team_id    = "6349983"
    }

  # github_team_repository.this["w3dt-stewards:rainbow"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "rainbow"
      + team_id    = "4656983"
    }

Plan: 4 to add, 1 to change, 1 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->